# PANDAS

In [1]:
import numpy as np 
ar=np.array([1,3,4,6,8])
ar

array([1, 3, 4, 6, 8])

In [2]:
# Pandas data structure
# series- 1D
# Dataframe- 2D
# Panel-3D

In [3]:
import pandas as pd
s1=pd.Series([1,3,4,6,8])
s1

0    1
1    3
2    4
3    6
4    8
dtype: int64

In [4]:
type(s1)

pandas.core.series.Series

In [5]:
s1.dtype

dtype('int64')

In [6]:
s1[0]

1

In [7]:
s1[3]

6

In [8]:
s1.index=["a","b","c","d","e"]
s1

a    1
b    3
c    4
d    6
e    8
dtype: int64

In [9]:
s1["b"]

3

In [10]:
s2=pd.Series(ar) # craete series from array
s2

0    1
1    3
2    4
3    6
4    8
dtype: int64

In [11]:
s3=pd.Series([75,86,45,96,76],index=["Kohli","Morgan","Smith","Rohit","stokes"],name="Score")
s3

Kohli     75
Morgan    86
Smith     45
Rohit     96
stokes    76
Name: Score, dtype: int64

In [12]:
s3["Kohli"]

75

In [13]:
s3[0]

75

In [14]:
s3["Kohli":"Rohit"]

Kohli     75
Morgan    86
Smith     45
Rohit     96
Name: Score, dtype: int64

In [15]:
s3[0:3]

Kohli     75
Morgan    86
Smith     45
Name: Score, dtype: int64

In [16]:
s3=s3+10

In [17]:
s3+5

Kohli      90
Morgan    101
Smith      60
Rohit     111
stokes     91
Name: Score, dtype: int64

In [18]:
s3

Kohli      85
Morgan     96
Smith      55
Rohit     106
stokes     86
Name: Score, dtype: int64

In [19]:
# create an random 6 numbers between 0 to 10
# craete a series with the squared value of these number

In [25]:
import numpy as np
np.random.seed(5)
ar=np.random.randint(1,10,6)
ar

array([4, 7, 7, 1, 9, 5])

In [26]:
s4=pd.Series(ar)
s4

0    4
1    7
2    7
3    1
4    9
5    5
dtype: int64

In [27]:
s4=s4*s4
s4

0    16
1    49
2    49
3     1
4    81
5    25
dtype: int64

In [29]:
s4.index=ar
s4

4    16
7    49
7    49
1     1
9    81
5    25
dtype: int64

In [30]:
s4[7]

7    49
7    49
dtype: int64

In [38]:
#vextorazation

s1=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
s2=pd.Series([67,78,34,6,7],index=["a","b","c","d","e"])
#s2=pd.Series([67,78,34,6,7],index=["a","b","c","f","h"])

#s4=pd.Series([67,78,34,6,7],index=["b","a","c","f","h"])
# 68,80,37

s3=s1+s2
s3

a    68
b    80
c    37
d    10
e    12
dtype: int64

In [36]:
#s3.isnull()# checking null or not
s3.isnull().sum()# finding n0.of null values in the series

4

In [ ]:
#Accessing the element

# loc- location----- element access based on labels
# iloc- index location ----element accesss based on index position

In [41]:
#s3["a"]

#s3.loc["a"]  # label
s3.iloc[0] # index

68

In [42]:
s3.loc["b":"d"]

b    80
c    37
d    10
dtype: int64

In [43]:
s3.iloc[1:4]

b    80
c    37
d    10
dtype: int64

# Pandas dataframe is 2 dimensional data

In [44]:
#create pandas using list ,dictionary

data=pd.DataFrame({"Name":["Anand","Neha","John","Dinesh"],"Age":[25,45,37,52],"martial status":["Yes","No","Yes","Yes"]})
data

     Name  Age martial status
0   Anand   25            Yes
1    Neha   45             No
2    John   37            Yes
3  Dinesh   52            Yes

In [48]:
# create adataframe using list method

data1=pd.DataFrame([["Anand",25,"Yes"],["Neha",45,"No"],["John",37,"yes"],["Dinesh",52,"Yes"]],
                   columns=["Name","Age","martial Status"],index=["a","b","c","d"])
data1

     Name  Age martial Status
a   Anand   25            Yes
b    Neha   45             No
c    John   37            yes
d  Dinesh   52            Yes

In [49]:
type(data1)

pandas.core.frame.DataFrame

In [50]:
data1.shape

(4, 3)

In [53]:
name=data1["Name"]
name

a     Anand
b      Neha
c      John
d    Dinesh
Name: Name, dtype: object

In [54]:
type(name)

pandas.core.series.Series

In [55]:
data1.loc["b":"d","Name":"Age"]

     Name  Age
b    Neha   45
c    John   37
d  Dinesh   52

In [61]:
#data1.iloc[1:4,:2]
data1.iloc[-4:-1,:2]

    Name  Age
a  Anand   25
b   Neha   45
c   John   37

In [70]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            4 non-null      object
 1   Age             4 non-null      int64
 2   martial Status  4 non-null      object
 3   graduation      4 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes